practice/js Practice/request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:cre="http://esb.ebe.eg/CIF/CreateModifyCIF" xmlns:fram="http://esb.ebe.eg/framework.message.header.v0.1">
  <soapenv:Header>
    <fram:MessageHeader>
      <GUID>${= java.util.UUID.randomUUID()}</GUID>
      <RequestId>90fb7718-9476-4edd-8cc4-e15697e81529</RequestId>
      <ChannelId>RetIntBank</ChannelId>
      <SourceId>Sumerge</SourceId>
      <LanguageCode>EN</LanguageCode>
      <UserId>Sumerge</UserId>
      <SourceEnvironment>DEV</SourceEnvironment>
      <ClientDateTime>2024-09-25T13:24:18.343Z</ClientDateTime>
    </fram:MessageHeader>
  </soapenv:Header>
  <soapenv:Body>
    <cre:CreateCIFRequest>
      <AccountsExtDetails>
        <KYCDate>2025-09-25T13:24:18.350Z</KYCDate>
      </AccountsExtDetails>
      <DemographicDetails>
        <GrossIncome>332423</GrossIncome>
        <EmploymentType>UNEMP</EmploymentType>
        <MaritalStatus>DIVOR</MaritalStatus>
        <Nationality>AL</Nationality>
        <ResidenceCountry/>
      </DemographicDetails>
      <GenDetails>
        <PrimarySolId>101</PrimarySolId>
        <AltCustFirstName>سيبسيب</AltCustFirstName>
        <AltCustLastName>يسبيسب</AltCustLastName>
        <AltCustMiddleName/>
        <AltName>سيبسيب يسبيسب</AltName>
        <BaseCurr>EGP</BaseCurr>
        <BirthDate>2005-05-17T00:00:00.00Z</BirthDate>
        <BirthPlace>14669</BirthPlace>
        <ContactDetails>
          <PhoneEmailList>
            <PhoneEmailDetails>
              <PhoneEmailType>
                <Value>CELLPH</Value>
              </PhoneEmailType>
              <PhoneNum>01002489234</PhoneNum>
              <PhoneNumCountryCode>+20</PhoneNumCountryCode>
              <PhoneOrEmail>PHONE</PhoneOrEmail>
              <PreferredForAlerts>Y</PreferredForAlerts>
            </PhoneEmailDetails>
            <PhoneEmailDetails>
              <EmailID>dfs@fdf.com</EmailID>
              <PhoneEmailType>
                <Value>E-STATEMENT</Value>
              </PhoneEmailType>
              <PhoneOrEmail>EMAIL</PhoneOrEmail>
              <PreferredForAlerts>Y</PreferredForAlerts>
            </PhoneEmailDetails>
          </PhoneEmailList>
          <PostAddrList>
            <!--Zero
                  or more repetitions:-->
            <PostAddrRec>
              <AddrFormat>S</AddrFormat>
              <AddrType>
                <Value>English</Value>
              </AddrType>
              <City>10</City>
              <Country>EG</Country>
              <!--PostAddr1>
                        <Addr3>test</Addr3>
                     </PostAddr1-->
              <PostAddr2>
                <HouseNum>2332</HouseNum>
                <LocalityName>null</LocalityName>
                <StreetName>sfdsf</StreetName>
                <StreetNum>23413</StreetNum>
                <Suburb>null</Suburb>
                <Town>null</Town>
              </PostAddr2>
              <PostalCode>12345</PostalCode>
              <StartDate>2024-9-25T00:00:00.00Z</StartDate>
              <State>999</State>
            </PostAddrRec>
            <PostAddrRec>
              <AddrFormat>S</AddrFormat>
              <AddrType>
                <Value>Home</Value>
              </AddrType>
              <City>10</City>
              <Country>EG</Country>
              <!--PostAddr1>
                        <Addr3>test</Addr3>
                     </PostAddr1-->
              <PostAddr2>
                <HouseNum>321</HouseNum>
                <LocalityName>null</LocalityName>
                <StreetName>sdfdsf</StreetName>
                <StreetNum>2342</StreetNum>
                <Suburb>null</Suburb>
                <Town>null</Town>
              </PostAddr2>
              <PostalCode>12345</PostalCode>
              <StartDate>2024-9-25T00:00:00.00Z</StartDate>
              <State>999</State>
            </PostAddrRec>
          </PostAddrList>
          <PreferredAddr>English</PreferredAddr>
          <PreferredEmail>E-STATEMENT</PreferredEmail>
          <PreferredPhone>CELLPH</PreferredPhone>
        </ContactDetails>
        <CustMinorFlag>Y</CustMinorFlag>
        <ElderPersonSrCitizen>N</ElderPersonSrCitizen>
        <Gender>M</Gender>
        <IdentityDocDetailsList>
          <!--Zero or more repetitions:-->
          <IdentityDocDetails>
            <CityOfIssue>11732</CityOfIssue>
            <CountryOfIssue>VGB</CountryOfIssue>
            <DocCode>PASSP</DocCode>
            <DocExpDate>2024-10-11T21:00:00.000Z</DocExpDate>
            <DocIssueDate>2024-08-31T21:00:00.000Z</DocIssueDate>
            <DocTypeCode>RETAIL</DocTypeCode>
            <PrefUniqueIDFlag>Y</PrefUniqueIDFlag>
            <RefNum>879789897789987</RefNum>
          </IdentityDocDetails>
        </IdentityDocDetailsList>
        <KYCStatus>A</KYCStatus>
        <NativeCustMiddleName/>
        <NativeLangCode>INFENG</NativeLangCode>
        <NRCustFlag>N</NRCustFlag>
        <Occupation>41</Occupation>
        <PersonNameDetails>
          <LastName>kljkljlk</LastName>
          <FirstName>kjkl</FirstName>
          <MiddleName/>
        </PersonNameDetails>
        <PrefName>PREFERRED</PrefName>
        <TitlePrefix>MINOR</TitlePrefix>
        <PrimaryRMID>FINACLECRM</PrimaryRMID>
        <PrimaryServiceCenter>101</PrimaryServiceCenter>
        <RiskRating>High Risk</RiskRating>
        <!--Sector>test</Sector-->
        <SegmentationClass>1</SegmentationClass>
        <ShortName>kjkl</ShortName>
        <!--Subsector>test</Subsector-->
      </GenDetails>
      <PsychographicDetails>
        <CustCurrList>
          <!--Zero or more repetitions:-->
          <CustCurrDetails>
            <CreditDiscountPercent>0</CreditDiscountPercent>
            <CurCode>EGP</CurCode>
            <DebitDiscountPercent>0</DebitDiscountPercent>
            <PrefExpDate>2099-08-08T00:00:00.000</PrefExpDate>
            <PrefType>
              <Value>CURRENCY</Value>
            </PrefType>
            <WithholdingTaxFloorLimit>0</WithholdingTaxFloorLimit>
            <WithholdingTaxPercent>0</WithholdingTaxPercent>
          </CustCurrDetails>
        </CustCurrList>
      </PsychographicDetails>
    </cre:CreateCIFRequest>
  </soapenv:Body>
</soapenv:Envelope>
